Repository: vistatec/vistatec-okapi
Catalog: okapi/tm/pensieve-server/src/main/resources/net/sf/okapi/tm/pensieve/server/mytm.tmx
Source language: en_us
Languages: fr_fr

source: Elephants cannot fly.
fr_fr: Les éléphants ne peuvent pas voler.

source: Elephants cannot fly, event when they are named Jumbo.
fr_fr: Les éléphants ne peuvent pas voler, même quand ils sont nommés Jumbo.

source: Small elephants can't fly.
fr_fr: Les petits éléphants ne peuvent pas voler.

source: Except when they are named Jumbo.
fr_fr: Sauf quand ils sont nommés Jumbo.

source: Big elephants cannot fly.
fr_fr: Les gros éléphants ne peuvent pas voler.

source: Even when they are named Jumbo.
fr_fr: Même quand ils sont nommés Jumbo.

source: But elephants with big ears can sometimes.
fr_fr: Mais les éléphants avec des grandes oreilles peuvent parfois.

source: Same as the folder where the project is saved -- Select this option to have the parameters files saved in the same folder as the project file.
fr_fr: Même que le dossier dans lequel le projet est enregistré -- Sélectionnez cette option pour que les paramètres des fichiers soient enregistrés dans le même dossier que le dossier du projet.

source: User-defined location -- Select this option to have the parameters files saved in a folder you choose.
fr_fr: Emplacenent définis par l'utilisateur -- Sélectionnez cette option pour que les paramètres des fichiers soient enregistrés dans un dossier que vous choisissez.

source: Enter the full location of the folder in the edit field below the option.
fr_fr: Entrez l'emplacement du dossier dans le champ d'édition sous l'option.

source: Add the following prefix -- Set this option to add a prefix at the start of each text unit.
fr_fr: Ajouter le préfixe suivant -- Activez cette option pour ajouter un préfixe au début de chaque unité de texte.

source: Enter the text of the prefix.
fr_fr: Entrez le texte du préfixe.

source: Add the following suffix -- Set this option to add a suffix at the end of each text unit.
fr_fr: Ajouter le suffixe suivant -- Activez cette option pour ajouter un suffixe à la fin de chaque unité de texte.

source: Enter the text of the suffix.
fr_fr: Entrez le texte du suffixe.

source: Append the name of the item -- Set this option to add the name of each text unit at the end of its value.
fr_fr: Ajoutez le nom de l'élément -- Activez cette option pour ajouter le nom de chaque unité de texte à la fin de sa valeur.

source: If the text unit has no name associated, the extraction ID is added instead.
fr_fr: Si l'unité de texte n'a pas de nom associé, l'identifiant d'extraction est ajouté à la place.

source: Append the extraction ID of the item -- Set this option to add the extraction ID of each text unit at the end of its value.
fr_fr: Ajoutez l'identifiant d'extraction de l'élément -- Activez cette option pour ajouter l'identifiant d'extraction de chaque unité de texte à la fin de sa valeur.

source: Extraction IDs are filter-specific.
fr_fr: Les identifiants d'extraction sont spécifiques à chaque filtre.

source: Modify also the items with an existing translation -- Set this option to apply the changes also to text units that already have a translation (e.g. for multilingual files).
fr_fr: Modifiez aussi les élément avec une traduction existante - Activez cette option pour appliquer les modifications également aux unités de texte qui ont déjà une traduction (par exemple pour les fichiers multilingues).

source: Marks segments with '[' and ']' delimiters -- Set this option to add delimiters to the segments in each text unit.
fr_fr: Marquez les segments avec '[' et ']' -- Activez cette option pour ajouter des délimiteurs aux les segments dans chaque unité de texte.

source: The delimiters are just around the text (after the prefix if one is added, and before the item name, extraction ID, and suffix if they are added).
fr_fr: Les délimiteurs sont juste autour du texte (après le préfixe, si il y en a un, et avant que le nom de l'élément, l'identifiant d'extraction, et le suffixe si ils y en a).

source: If the Apply the following segmentation rules option is set you may have more than one segment per text unit, otherwise each text unit is a single segment.
fr_fr: Si l'option "Appliquer les règles de segmentation suivantes" est définie, vous pouvez avoir plus d'un segment par unité de texte, sinon, chaque unité de texte est un seul segment.
